print('Задача 4. Площадь треугольника')

# Напишите программу,
# которая запрашивает у пользователя длины двух катетов
# в прямоугольном треугольнике и выводит его площадь.

# Формула:
# S = ab/2
cathet_one = int(input("Enter first cathet: "))
cathet_two = int(input("Enter second cathet: "))
print("Square of triangle = ", (cathet_one * cathet_two) / 2)
