print('Задача 6. Новоселье')

# Семья из трёх человек устала тесниться в однушке и наконец решила переехать.
# При обсуждении,
# какую же всё-таки купить квартиру исходя из своих предпочтений и семейного бюджета,
# они остановились на нескольких вариантах:

# Первый вариант
# они готовы взять квартиру попросторнее (не менее 100 квадратных метров),
# но стоимостью не более 10 млн.

# Второй вариант — немного расширить круг поиска,
# то есть взять квартиру поменьше (от 80 квадратный метров),
# но и стоимостью не более 7 млн.

# Напишите программу,
# которая получает на вход стоимость квартиры и её площадь
# и выводит сообщение о том, подходит она или нет

apartment_cost = int(input("Enter apartment's price: "))
apartment_area = int(input("Enter apartment's area: "))

if apartment_area > 0 and apartment_cost > 0:
    if apartment_area >= 100 and apartment_cost <= 10_000_000 or apartment_area >= 80 and apartment_cost <= 7_000_000:
        print("Yes!")
    else:
        print("No!")
else:
    print("error")
